Ruby_Proj/W4D4/musicapp/app/controllers/bands_controller.rb

    def show
        @band=Band.find_by(id:params[:id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def edit
        @band=Band.find_by(id:params[:id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        @band=Band.find_by(id:params[:id])
        if @band.update(band_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Simon and Garfunkel"], ["updated_at", "2019-05-02 21:19:06.509806"], ["id", 1]]