Ruby_Proj/W4D4/musicapp/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["email", "mthomas083@gmail.com"], ["password_digest", "$2a$10$cYZJ3uYqnN9f0/TlBrnSRu8ki8ZedoChWrehQl6j6w9Zmb9rroh0i"], ["session_token", "rY_d2agGpj3vC-nnVyet9w"]]
---
    def create
        @user= User.new(user_params)
        @user.save