React/W8D1/BencbBnB/app/controllers/api/benches_controller.rb

    def index
        @benches = Bench.all
---
SELECT "benches".* FROM "benches"