Ruby_Proj/W4D1/routes/app/controllers/artworks_controller.rb

    def index
        user = User.find(params[:banana])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]

    def create
        artwork = Artwork.new(artwork_params)
        if artwork.save
---
INSERT INTO "artworks" ("title", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Girl with Pearl Earings"], ["artist_id", 12], ["created_at", "2019-04-29 20:06:41.454057"], ["updated_at", "2019-04-29 20:06:41.454057"]]

    def destroy
        artwork = Artwork.find(params[:id])
        artwork.destroy
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 2]]