Ruby_Proj/W4D1/routes/app/controllers/artwork_shares_controller.rb

SELECT "artwork_shares".* FROM "artwork_shares"
---
    def index
        render json: ArtworkShare.all

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 1], ["viewer_id", 12], ["created_at", "2019-04-29 20:28:19.061641"], ["updated_at", "2019-04-29 20:28:19.061641"]]
---
    def create
        artwork_share = ArtworkShare.new(artwork_share_params)
        if artwork_share.save

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 5]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 1]]
---
    def destroy
        artwork_share = ArtworkShare.find(params[:id])
        artwork_share.destroy