Ruby_Proj/W4D1/routes/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "Toucan Sam"], ["updated_at", "2019-04-29 19:34:16.912632"], ["id", 11]]
---
    def update
        user = User.find(params[:id])
        if user.update(user_params)