Ruby_Proj/W4D2/mycats/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats"
---
    def index
       @cats = Cat.all

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def show
        @cat = Cat.find(params[:id])

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @cat = Cat.find(params[:id])