Ruby_Proj/W4D5/goalsapp/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 113], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 113]]
---
    def destroy
        @user = User.find_by(id: params[:id])
        if @user.destroy