Ruby_Proj/W4D4/musicapp/app/models/user.rb

    def password=(password)
        @password = password
        self.password_digest = BCrypt::Password.create(password)
---
INSERT INTO "users" ("email", "password_digest") VALUES ($1, $2) RETURNING "id"  [["email", "mthomas@gmail.com"], ["password_digest", "$2a$10$4gtI5b6pasZjraDQ72q5Uec4i1MVmJrz6KIaWxavlN4KcxiRaXx.O"]]

    def reset_session_token!
        self.session_token = SecureRandom.urlsafe_base64(16)
        self.save!
---
UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "zU7yENUcjpfeybVZ7PsQ-A"], ["id", 2]]