JS/W7D1/todos/railstodos/app/controllers/api/todos_controller.rb

SELECT "todos".* FROM "todos"
---
    def index
        @todos = Todo.all