React/W8D1/BencbBnB/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "demo5"], ["LIMIT", 1]]
---
    def self.find_by_credentials(username, password)
        user = User.find_by_username( username )

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "EHZoXfuJrfehMLpFhIfkUA"], ["updated_at", "2019-05-24 18:24:10.985986"], ["id", 5]]
---
    def reset_session_token
        self.session_token = SecureRandom::urlsafe_base64
        self.save!