Ruby_Proj/W4D1/routes/app/models/artwork.rb

    def unique_combination?
        if Artwork.exists?(title: self.title, artist_id: self.artist_id)
---
SELECT  1 AS one FROM "artworks" WHERE "artworks"."title" = $1 AND "artworks"."artist_id" = $2 LIMIT $3  [["title", "Mona Lisa"], ["artist_id", 9], ["LIMIT", 1]]